InformationRegisters/ОчередьПолученияДанныхГИСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ОчередьПолученияДанныхГИСМ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>action_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>GLN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GLN</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>output_id</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерДокументаГИСМ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьПолученияДанныхГИСМ/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.Данные
		|ИЗ
		|	РегистрСведений.ОчередьПолученияДанныхГИСМ КАК Т
		|ГДЕ
		|	Т.GLN = &GLN
		|	И Т.output_id = &output_id");
		
		Запрос.УстановитьПараметр("GLN", Запись.GLN);
		Запрос.УстановитьПараметр("output_id", Запись.output_id);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Сообщения = Выборка.Данные.Получить();
			
			Если Сообщения <> Неопределено Тогда
				
				ТекстовыйДокументКонвертSOAP.УстановитьТекст(Сообщения.ТекстВходящегоСообщенияXML);
				
				ТекстСообщенияXML = ИнтеграцияГИСМВызовСервера.ТекстВходящегоСообщенияXML(Сообщения.ТекстВходящегоСообщенияXML);
				ТекстСообщенияXML = ИнтеграцияГИСМВызовСервера.ФорматироватьXMLСПараметрами(ТекстСообщенияXML, ИнтеграцияГИСМ.ПараметрыФорматированияXML(Истина, "  "));
				
				ТекстовыйДокументТекстСообщенияXML.УстановитьТекст(ТекстСообщенияXML);
				
			Иначе
				
				ТекстовыйДокументКонвертSOAP.УстановитьТекст(НСтр("ru = '<SOAP-конверт не загружен>'"));
				ТекстовыйДокументТекстСообщенияXML.УстановитьТекст(НСтр("ru = '<SOAP-конверт не загружен>'"));
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПодготовитьКПовторнойЗагрузке Тогда
		ТекущийОбъект.Данные = Новый ХранилищеЗначения(Неопределено);
		ПодготовитьКПовторнойЗагрузке = Ложь;
		ТекстовыйДокументКонвертSOAP.УстановитьТекст(НСтр("ru = '<SOAP-конверт не загружен>'"));
		ТекстовыйДокументТекстСообщенияXML.УстановитьТекст(НСтр("ru = '<SOAP-конверт не загружен>'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодготовитьКПовторнойЗагрузке(Команда)
	
	ПодготовитьКПовторнойЗагрузке = Истина;
	Записать();
	
КонецПроцедуры

#КонецОбласти
